{
    "Service is healthy": "Service is healthy.",
    "Fields must be an array or an object": "Fields must be provided as an array or an object.",
    "Update Fields must be an array or an object": "Update fields must be provided as an array or an object.",
    "Where Fields must be an array or an object": "Where clause fields must be provided as an array or an object.",
    "User role not found": "User role not found.",
    "User role found": "User role found successfully.",
    "An error occurred while fetching user role details": "An error occurred while fetching user role details.",
    "User role already exists": "User role already exists.",
    "User role does not exists in system": "The specified user role does not exist in the system.",
    "An error occurred while verifying user role in system": "An error occurred while verifying the user role.",
    "User role registered successfully": "User role registered successfully.",
    "An error occurred while registering new user role in system": "An error occurred while registering the user role.",
    "An error occurred while processing the request": "An error occurred while processing the request.",
    "No user role found": "No user roles found.",
    "An error occurred while fetching user roles": "An error occurred while fetching user roles.",
    "No user found with the provided user id": "No user found with the provided user ID.",
    "Requested user info fetched successfully": "User information retrieved successfully.",
    "An error occurred while retrieving the user details": "An error occurred while retrieving user details.",
    "Username or email id provided is already taken": "The username or email address is already in use.",
    "An error occurred while validating if the username or email already taken": "An error occurred while checking username or email availability.",
    "No user role found. Cannot proceed further": "No user role found. Unable to proceed.",
    "User registered successfully": "User registered successfully.",
    "An error occurred while registering new user in system": "An error occurred while registering the user.",
    "An error occurred while trying to generate the verification code": "An error occurred while generating the verification code.",
    "No user meta info found for the provided id": "No user information found for the provided ID.",
    "User email verification code invalid": "The email verification code is invalid.",
    "Verification code has been expired. New code will be send for verification": "The verification code has expired. A new code has been sent.",
    "Email is verified": "Email verified successfully.",
    "An error occurred while verifying the user email id": "An error occurred while verifying the email address.",
    "User already verified": "User is already verified.",
    "No user found for the provided identity": "No user found with the provided credentials.",
    "User found": "User found successfully.",
    "Account not yet verified": "Your account has not been verified yet.",
    "Invalid Credentials": "Invalid credentials provided.",
    "User login successful": "Login successful.",
    "Error occured while granting access to the user": "An error occurred while granting access to the user.",
    "An error occurred while granting access to the user": "An error occurred while granting access to the user.",
    "Requested user does not exists": "The requested user does not exist.",
    "User Profile fetched successfully": "User profile retrieved successfully.",
    "An error occurred while performing user logout operation": "An error occurred while logging out.",
    "User logout": "User logged out successfully.",
    "Refresh Token not found": "Refresh token not found.",
    "No Token stored in db": "No token available.",
    "Invalid Token found": "Invalid token found.",
    "Token Expired or Invalid": "The token has expired or is invalid.",
    "User scope already exists": "User scope already exists.",
    "User scope does not exists in system": "The specified user scope does not exist.",
    "An error occurred while validating user scope in system": "An error occurred while validating the user scope.",
    "User scope registered successfully": "User scope registered successfully.",
    "An error occurred while registering new user scope in system": "An error occurred while registering the user scope.",
    "User scope not found": "User scope not found.",
    "User scope found": "User scope found successfully.",
    "request/body must have required property 'role_desc'": "request/body must have required property 'role_desc'",
    "request/body must have required property 'is_default'": "request/body must have required property 'is_default'",
    "request/body must have required property 'is_active'": "request/body must have required property 'is_active'",
    "An error occurred while deactivating existing default user role": "An error occurred while deactivating the existing default user role.",
    "User role details updated successfully": "User role details updated successfully.",
    "An error occurred while updating user role detail in system": "An error occurred while updating the user role details.",
    "An error occurred while updating user role default value in system": "An error occurred while updating the default user role.",
    "An error occurred while deleting requested user role": "We couldn’t delete the selected user role. Please try again later.",
    "User role deleted successfully": "The user role has been deleted successfully.",
    "Default user role cannot be deleted": "The default user role cannot be deleted.",
    "User scope details updated successfully": "User scope have been updated successfully.",
    "An error occurred while updating user scope in system": "An error occurred while updating the user scope",
    "User scope deleted successfully": "User scope has been deleted successfully.",
    "An error occurred while deleting requested user scope": "An error occurred while deleting the requested user scope."
}